Repository: growerp/growerp
Catalog: flutter/packages/growerp_marketing/lib/l10n/intl_*.arb
Languages: nl, th

# tableHdrShortId
source: ShortId
nl: KorteId
th: รหัสย่อ

# tableHdrId
source: Id
th: รหัส

# tableHdrName
source: Name
nl: Naam
th: ชื่อ

# tableHdrAmount
source: Amount
nl: Bedrag
th: จำนวนเงิน

# tableHdrProbability
source: Probability
nl: Waarschijnlijkheid
th: ความน่าจะเป็น

# tableHdrLead
source: Lead name/company
nl: Lead naam/bedrijf
th: ชื่อผู้มุ่งหวัง/บริษัท

# tableHdrLeadEmail
source: Lead Email
th: อีเมลผู้มุ่งหวัง

# tableHdrStage
source: Stage
nl: Fase
th: ขั้นตอน

# tableHdrNextStep
source: Next Step
nl: Volgende Stap
th: ขั้นตอนต่อไป

# removeItemTooltip
source: Remove Item
nl: Item Verwijderen
th: ลบรายการ

# deleteItemConfirm
source: Delete {id}?
nl: {id} verwijderen?
th: ลบ {id}?

# cannotBeUndone
source: This action cannot be undone!
nl: Deze actie kan niet ongedaan worden gemaakt!
th: การกระทำนี้ไม่สามารถยกเลิกได้!

# error
source: Error: {message}
nl: Fout: {message}
th: ข้อผิดพลาด: {message}

source: Unknown
nl: Onbekend
th: ไม่ทราบ

# opportunityNew
source: New Opportunity
nl: Nieuwe Opportunity
th: โอกาสใหม่

# opportunityWithMessage
source: Opportunity {id}
th: โอกาส {id}

source: ID
th: รหัส

source: Opportunity Name
nl: Opportunitynaam
th: ชื่อโอกาส

# enterOppName
source: Enter Opportunity Name
nl: Voer Opportunitynaam in
th: ป้อนชื่อโอกาส

source: Description
nl: Omschrijving
th: คำอธิบาย

# expRevenue
source: Expected Revenue
nl: Verwachte Omzet
th: รายได้ที่คาดหวัง

source: Enter Amount
nl: Voer Bedrag in
th: ป้อนจำนวนเงิน

# estProbability
source: Estimated Probability
nl: Geschatte Waarschijnlijkheid
th: ความน่าจะเป็นโดยประมาณ

source: Enter Probability
nl: Voer Waarschijnlijkheid in
th: ป้อนความน่าจะเป็น

source: Next Step
nl: Volgende Stap
th: ขั้นตอนต่อไป

source: Enter Next Step
nl: Voer Volgende Stap in
th: ป้อนขั้นตอนต่อไป

source: Stage
nl: Fase
th: ขั้นตอน

# fieldRequired
source: Field is required
nl: Veld is verplicht
th: ต้องระบุข้อมูลในฟิลด์นี้

source: Lead Search
nl: Lead Zoeken
th: ค้นหาผู้มุ่งหวัง

source: Select Lead
nl: Selecteer Lead
th: เลือกผู้มุ่งหวัง

source: Lead
th: ผู้มุ่งหวัง

source: Employee Search
nl: Medewerker Zoeken
th: ค้นหาพนักงาน

source: Select Employee
nl: Selecteer Medewerker
th: เลือกพนักงาน

source: Account Employee
nl: Account Medewerker
th: พนักงานบัญชี

source: Create
nl: CreÃ«er
th: สร้าง

source: Update
th: อัปเดต

source: Server problem
nl: Serverprobleem
th: ปัญหาเกี่ยวกับเซิร์ฟเวอร์

# fetchError
source: Fetch error: {message}
nl: Ophaalfout: {message}
th: ข้อผิดพลาดในการดึงข้อมูล: {message}

# noOpportunities
source: No opportunities found
nl: Geen opportunities gevonden
th: ไม่พบโอกาส

source: Add New
nl: Nieuwe Toevoegen
th: เพิ่มใหม่

# fetchSearchError
source: Search error: {message}
nl: Zoekfout: {message}
th: ข้อผิดพลาดในการค้นหา: {message}

source: Opportunity Search
nl: Opportunity Zoeken
th: ค้นหาโอกาส

source: Search Input
nl: Zoekinvoer
th: ข้อมูลสำหรับการค้นหา

source: Enter Search Value
nl: Voer Zoekwaarde in
th: ป้อนค่าสำหรับการค้นหา

source: Search Results
nl: Zoekresultaten
th: ผลการค้นหา

source: No search items
nl: Geen zoekitems
th: ไม่พบรายการที่ค้นหา

# searchResult
source: ID: {id}, Name: {name}
nl: ID: {id}, Naam: {name}
th: รหัส: {id}, ชื่อ: {name}
