Repository: growerp/growerp
Catalog: flutter/packages/growerp_core/lib/l10n/app_*.arb
Languages: th

source: Login with existing username
th: เข้าสู่ระบบด้วยชื่อผู้ใช้ที่มีอยู่

# createPassword
source: Create New Password
th: สร้างรหัสผ่านใหม่

# username
source: Username: {username}
th: ชื่อผู้ใช้: {username}

source: Password
th: รหัสผ่าน

# passwordHelper
source: At least 8 characters, including alpha, number & special character, no previous password.
th: อย่างน้อย 8 ตัวอักษร ประกอบด้วยตัวอักษร ตัวเลข และอักขระพิเศษ ไม่ใช้รหัสผ่านเดิม

# passwordError
source: Please enter first password?
th: กรุณาป้อนรหัสผ่านแรก

# passwordValidationError
source: At least 8 characters, including alpha, number & special character.
th: อย่างน้อย 8 ตัวอักษร ประกอบด้วยตัวอักษร ตัวเลข และอักขระพิเศษ

source: Verify Password
th: ยืนยันรหัสผ่าน

# verifyPasswordHelper
source: Enter the new password again.
th: ป้อนรหัสผ่านใหม่อีกครั้ง

# verifyPasswordError
source: Enter password again to verify?
th: ป้อนรหัสผ่านอีกครั้งเพื่อยืนยัน

# passwordMismatch
source: Password is not matching
th: รหัสผ่านไม่ตรงกัน

source: Submit new Password
th: ส่งรหัสผ่านใหม่

# completeRegistration
source: Complete your registration
th: ทำการลงทะเบียนให้เสร็จสมบูรณ์

source: Welcome!
th: ยินดีต้อนรับ!

# enterCompanyAndCurrency
source: please enter both the company name and currency for the new company
th: กรุณาป้อนทั้งชื่อบริษัทและสกุลเงินสำหรับบริษัทใหม่

# enterCompanyName
source: please enter optionally a company name you work for.
th: กรุณาป้อนชื่อบริษัทที่คุณทำงาน (ไม่บังคับ)

source: Business Company name
th: ชื่อบริษัทธุรกิจ

# businessNameError
source: Please enter business name("Private" for Private person)
th: กรุณาป้อนชื่อธุรกิจ (ป้อน "Private" สำหรับบุคคลธรรมดา)

source: Currency
th: สกุลเงิน

# currencyError
source: Currency field required!
th: ต้องระบุสกุลเงิน!

source: Generate demo data
th: สร้างข้อมูลตัวอย่าง

source: DemoData
th: ข้อมูลตัวอย่าง

# continueButton
source: Continue
th: ดำเนินการต่อ

source: Username/Email
th: ชื่อผู้ใช้/อีเมล

# usernameEmailError
source: Please enter username or email?
th: กรุณาป้อนชื่อผู้ใช้หรืออีเมล

# passwordError2
source: Please enter your password?
th: กรุณาป้อนรหัสผ่านของคุณ

source: Login
th: เข้าสู่ระบบ

# forgotPassword
source: forgot/change password?
th: ลืม/เปลี่ยนรหัสผ่าน?

source: Subscription
th: การสมัครสมาชิก

# currentPaymentMethod
source: Your current payment method: {ccDescription}
th: วิธีการชำระเงินปัจจุบันของคุณ: {ccDescription}

# trialPeriod
source: You have a trial period for 2 weeks, We will only charge if you not cancel before that time
th: คุณมีระยะเวลาทดลองใช้ 2 สัปดาห์ เราจะเรียกเก็บเงินก็ต่อเมื่อคุณไม่ยกเลิก ก่อนเวลานั้น

# testSystem
source: This is a Test system so this credit Card will always be approved
th: นี่คือระบบทดสอบ ดังนั้นบัตรเครดิตนี้จะได้รับการอนุมัติเสมอ

source: Payment Plan
th: แผนการชำระเงิน

# selectPlanError
source: Please select a single plan
th: กรุณาเลือกแผนเดียวเท่านั้น

# creditCardInfo
source: Credit card information
th: ข้อมูลบัตรเครดิต

# creditCardDetails
source: Enter your credit card details
th: ป้อนรายละเอียดบัตรเครดิตของคุณ

source: Number
th: หมายเลข

# expiryDate
source: Expiry month/year
th: เดือน/ปีที่หมดอายุ

source: CVV Code
th: รหัส CVV

source: Name on Card
th: ชื่อบนบัตร

# payWithinWeek
source: Pay within one week
th: ชำระเงินภายในหนึ่งสัปดาห์

# registerAndCharge
source: Register and charge in 2 weeks
th: ลงทะเบียนและเรียกเก็บเงินใน 2 สัปดาห์

# sendNewPassword
source: Send new Password by email
th: ส่งรหัสผ่านใหม่ทางอีเมล

source: Email:
th: อีเมล:

source: Ok
th: ตกลง

# deleteWarning
source: Please note you will be blocked using the system. This cannot be undone!
th: โปรดทราบว่าคุณจะถูกบล็อกไม่ให้ใช้ระบบ การกระทำนี้ไม่สามารถยกเลิกได้!

source: Only User delete
th: ลบเฉพาะผู้ใช้

source: User AND Company delete
th: ลบผู้ใช้และบริษัท

source: Delete yourself
th: ลบตัวคุณเอง

# deleteYourselfAndCompany
source: Delete yourself and opt. company?
th: ลบตัวคุณเองและบริษัท (ถ้ามี)?

source: Registration
th: การลงทะเบียน

source: First Name
th: ชื่อจริง

# firstNameError
source: Please enter your first name?
th: กรุณาป้อนชื่อจริงของคุณ

source: Last Name
th: นามสกุล

# lastNameError
source: Please enter your last name?
th: กรุณาป้อนนามสกุลของคุณ

# tempPassword
source: A temporary password will be send by email
th: รหัสผ่านชั่วคราวจะถูกส่งทางอีเมล

source: Email address
th: ที่อยู่อีเมล

# emailAddressError
source: Please enter Email address?
th: กรุณาป้อนที่อยู่อีเมล

# emailAddressError2
source: This is not a valid email
th: นี่ไม่ใช่อีเมลที่ถูกต้อง

source: Register
th: ลงทะเบียน

source: About GrowERP
th: เกี่ยวกับ GrowERP

# aboutApp
source: About GrowERP and this {appName} app
th: เกี่ยวกับ GrowERP และแอป {appName} นี้

# version
source: Version {version}, build #{build}
th: เวอร์ชัน {version} บิวด์ #{build}

# copyright
source: Â© GrowERP, {year}
th: © GrowERP, {year}

source: View Readme
th: ดู Readme

source: View License
th: ดูใบอนุญาต

source: Contributing
th: การมีส่วนร่วม

source: Privacy, Code of conduct
th: ความเป็นส่วนตัว, จรรยาบรรณ

source: Open source Licenses
th: ใบอนุญาตโอเพนซอร์ส

# enterBackendUrl
source: Enter a backend && chat url in the form of: xxx.yyy.zzz
th: ป้อน URL แบ็กเอนด์และแชทในรูปแบบ: xxx.yyy.zzz

source: Backend server:
th: เซิร์ฟเวอร์แบ็กเอนด์:

source: field required!
th: ต้องระบุข้อมูลในฟิลด์นี้!

source: Chat server:
th: เซิร์ฟเวอร์แชท:

# companyPartyId
source: partyId of main company:
th: partyId ของบริษัทหลัก:

source: Cancel
th: ยกเลิก

source: Restart
th: เริ่มต้นใหม่

source: Main
th: หลัก

# noAccess
source: No Access to any option
th: ไม่สามารถเข้าถึงตัวเลือกใดๆ

source: Add New
th: เพิ่มใหม่

source: Chat
th: แชท

source: Go Home
th: ไปที่หน้าหลัก

source: test
th: ทดสอบ

source: Theme
th: ธีม

# error
source: error: should not arrive here
th: ข้อผิดพลาด: ไม่ควรมาถึงที่นี่

# noAccessHere
source: No access to any option here,
th: ไม่สามารถเข้าถึงตัวเลือกใดๆ ที่นี่,

# noRestRequests
source: No REST requests found
th: ไม่พบคำขอ REST

# cannotLoadRestRequests
source: Could not load REST requests!
th: ไม่สามารถโหลดคำขอ REST ได้!

source: Refresh
th: รีเฟรช

source: REST Request Details
th: รายละเอียดคำขอ REST

source: Date/Time
th: วันที่/เวลา

source: Unknown
th: ไม่ทราบ

source: User
th: ผู้ใช้

# notAvailable
source: N/A
th: ไม่มีข้อมูล

source: Login Name
th: ชื่อล็อกอิน

source: Request Name
th: ชื่อคำขอ

source: Server IP
th: IP เซิร์ฟเวอร์

source: Server Host
th: โฮสต์เซิร์ฟเวอร์

source: Running Time
th: เวลาทำงาน

source: ms
th: มิลลิวินาที

source: Status
th: สถานะ

source: Success
th: สำเร็จ

source: Slow Hit
th: การเข้าถึงช้า

source: Yes
th: ใช่

source: No
th: ไม่

source: Error Message:
th: ข้อความแสดงข้อผิดพลาด:

source: Request URL:
th: URL คำขอ:

source: Referrer URL:
th: URL ผู้อ้างอิง:

source: Parameters:
th: พารามิเตอร์:

source: Logout
th: ออกจากระบบ

# welcomeToGrowERPBusinessSystem
source: Welcome to The GrowERP Business System
th: ยินดีต้อนรับสู่ระบบธุรกิจ GrowERP

source: Select Language
th: เลือกภาษา

# registerNewCompanyAndAdmin
source: Register new Company and Administrator
th: ลงทะเบียนบริษัทและผู้ดูแลระบบใหม่

source: Create
th: สร้าง

source: Update
th: อัปเดต

source: Customer
th: ลูกค้า

source: Supplier
th: ซัพพลายเออร์

source: and at least one
th: และอย่างน้อยหนึ่ง

source: item is required
th: รายการจำเป็นต้องระบุ

source: Organization
th: องค์กร

source: Company
th: บริษัท

source: Employees
th: พนักงาน

source: Website
th: เว็บไซต์

source: CRM
th: ระบบบริหารลูกค้า

source: My To Do, tasks
th: งานที่ต้องทำของฉัน

source: Opportunities
th: โอกาส

source: My Opportunities
th: โอกาสของฉัน

source: Leads
th: ลูกค้าเป้าหมาย

source: Customers
th: ลูกค้า

source: Requests
th: คำขอ

source: Catalog
th: แคตตาล็อก

source: Products
th: สินค้า

source: Assets
th: สินทรัพย์

source: Categories
th: หมวดหมู่

source: Subscriptions
th: การสมัครสมาชิก

source: Orders
th: คำสั่งซื้อ

source: Sales orders
th: คำสั่งซื้อขาย

source: Purchase orders
th: คำสั่งซื้อจัดซื้อ

source: Suppliers
th: ผู้จัดจำหน่าย

source: Inventory
th: สินค้าคงคลัง

source: Outgoing shipments
th: การจัดส่งออก

source: Incoming shipments
th: การจัดส่งเข้า

source: WH Locations
th: ที่ตั้งคลังสินค้า

source: Accounting
th: การบัญชี

source: Accounting DashBoard
th: แดชบอร์ด บัญชี

source: Accounting Sales
th: บัญชีการขาย

source: Accounting Purch.
th: บัญชีการซื้อ

source: Accounting Ledger
th: บัญชีแยกประเภท

source: Outgoing Invoices
th: ใบแจ้งหนี้ออก

source: Incoming Payments
th: การชำระเงินเข้า

source: Incoming Invoices
th: ใบแจ้งหนี้เข้า

source: Outgoing Payments
th: การชำระเงินออก

source: Ledger Tree
th: แผนผังบัญชี

source: Ledger Accnt
th: บัญชีแยกประเภท

source: Ledger Transaction
th: รายการบัญชี

source: Ledger Journals
th: สมุดรายวันบัญชี

source: Reports
th: รายงาน

source: Revenue/Expense
th: รายได้/ค่าใช้จ่าย

source: Balance Sheet
th: งบดุล

source: Balance Summary
th: สรุปยอดคงเหลือ

source: SetUp
th: ตั้งค่า

source: Time Periods
th: ช่วงเวลา

source: Item Types
th: ประเภทสินค้า

source: Paymt Types
th: ประเภทการชำระเงิน

source: Plan Selection
th: เลือกแผน

source: Main dashboard
th: แดชบอร์ดหลัก

source: About
th: เกี่ยวกับ

source: Tasks
th: งาน

source: Applications
th: แอปพลิเคชัน

source: REST Requests
th: คำขอ REST

source: Clients
th: ลูกค้า

source: Staff
th: พนักงาน

source: My Hotel
th: โรงแรมของฉัน

source: Rooms
th: ห้องพัก

source: Room Types
th: ประเภทห้องพัก

source: Reservations
th: การจอง

source: In-Out
th: เข้า-ออก

source: CheckIn
th: เช็คอิน

source: CheckOut
th: เช็คเอาต์

source: Administrators
th: ผู้ดูแลระบบ

source: Other Employees
th: พนักงานอื่นๆ

source: All Opportunities
th: โอกาสทั้งหมด

source: Sales open invoices
th: ใบแจ้งหนี้ขายที่ยังค้างชำระ

source: Purchase unpaid invoices
th: ใบแจ้งหนี้ซื้อที่ยังไม่ชำระ
