Repository: growerp/growerp
Catalog: flutter/packages/growerp_chat/lib/l10n/intl_*.arb
Languages: nl, th

source: Chat not active!
nl: Chat niet actief!
th: แชทไม่ทำงาน!

source: Message text..
nl: Berichttekst..
th: ข้อความ..

source: Send
nl: Versturen
th: ส่ง

source: Add partner
nl: Partner toevoegen
th: เพิ่มคู่สนทนา

source: Chat #
th: แชท #

# newChat
source: New
nl: Nieuw
th: ใหม่

source: Select chat partner
nl: Selecteer chatpartner
th: เลือกคู่สนทนา

source: Chat partner
th: คู่สนทนา

source: Field required
nl: Veld vereist
th: ต้องระบุข้อมูล

source: Create
nl: CreÃ«er
th: สร้าง

source: Update
th: อัปเดต

source: Room
nl: Kamer
th: ห้อง

source: ChatRoom
nl: ChatKamer
th: ห้องแชท

source: Chat users and groups
nl: Chatgebruikers en -groepen
th: ผู้ใช้และกลุ่มแชท

source: Add New
nl: Nieuwe toevoegen
th: เพิ่มใหม่

source: no
nl: geen
th: ไม่พบ

source: s found!
nl: s gevonden!
th: ที่พบ!

source: search in name ..
nl: zoek in naam ..
th: ค้นหาในชื่อ ..

source: Search
nl: Zoeken
th: ค้นหา

source: Name
nl: Naam
th: ชื่อ

source: Status
th: สถานะ

source: Pvt.
th: ส่วนตัว

# nroMembers
source: #Mem.
nl: #Leden.
th: #สมาชิก

source: All messages read
nl: Alle berichten gelezen
th: อ่านข้อความทั้งหมดแล้ว

source: unread messages
nl: onbekende berichten
th: ข้อความที่ยังไม่ได้อ่าน

# chatRoomUpdateSuccess
source: Chat room updated successfully
nl: Chatruimte succesvol bijgewerkt
th: อัปเดตห้องแชทสำเร็จ

# chatRoomUpdateFailure
source: Failed to update chat room
nl: Bijwerken van chatruimte mislukt
th: การอัปเดตห้องแชทล้มเหลว

# chatRoomDeleteSuccess
source: Chat room deleted successfully
nl: Chatruimte succesvol verwijderd
th: ลบห้องแชทสำเร็จ

# chatRoomDeleteFailure
source: Failed to delete chat room
nl: Verwijderen van chatruimte mislukt
th: การลบห้องแชทล้มเหลว

# chatRoomAddSuccess
source: Chat room added successfully
nl: Chatruimte succesvol toegevoegd
th: เพิ่มห้องแชทสำเร็จ

# chatRoomAddFailure
source: Failed to add chat room
nl: Toevoegen van chatruimte mislukt
th: การเพิ่มห้องแชทล้มเหลว

# chatRoomFetchFailure
source: Failed to fetch chat rooms
nl: Ophalen van chatruimtes mislukt
th: การดึงข้อมูลห้องแชทล้มเหลว

# chatMessageSendSuccess
source: Message sent successfully
nl: Bericht succesvol verzonden
th: ส่งข้อความสำเร็จ

# chatMessageSendFailure
source: Failed to send message
nl: Verzenden van bericht mislukt
th: การส่งข้อความล้มเหลว

# chatMessageDeleteSuccess
source: Message deleted successfully
nl: Bericht succesvol verwijderd
th: ลบข้อความสำเร็จ

# chatMessageDeleteFailure
source: Failed to delete message
nl: Verwijderen van bericht mislukt
th: การลบข้อความล้มเหลว

# chatMessageFetchFailure
source: Failed to fetch messages
nl: Ophalen van berichten mislukt
th: การดึงข้อมูลข้อความล้มเหลว
