Repository: growerp/growerp
Catalog: flutter/packages/growerp_inventory/lib/l10n/intl_*.arb
Languages: nl

source: Product name
nl: Productnaam

# failedToFetchLocations
source: failed to fetch locations: {message}
nl: locaties ophalen mislukt: {message}

source: no locations found
nl: geen locaties gevonden

source: Add New
nl: Nieuwe toevoegen

# addSuccess
source: Add successful
nl: Toevoegen gelukt

# updateSuccess
source: Update successful
nl: Update gelukt

# error
source: Error: {message}
nl: Fout: {message}

# locationInfo
source: Location Information #{pseudoId}
nl: Locatie-informatie #{pseudoId}

# newLabel
source: New
nl: Nieuw

source: Location Id
nl: Locatie-ID

source: Location Name
nl: Locatienaam

# enterLocationName
source: Please enter a location name?
nl: Voer een locatienaam in

source: Quantity on Hand
nl: Aantal op voorraad

source: Create
nl: CreÃ«er

# failedToFetchSearchItems
source: failed to fetch search items: {message}
nl: ophalen van zoekitems mislukt: {message}

source: Location Search
nl: Locatie zoeken

source: Search input
nl: Zoekinvoer

# enterSearchValue
source: Please enter a search value?
nl: Voer een zoekwaarde in

source: Search results
nl: Zoekresultaten

# noSearchItemsFound
source: No search items found (yet)
nl: Geen zoekitems gevonden (nog)

source: Name:
nl: Naam:

source: Room Number
nl: Kamernummer

source: Asset Number
nl: Activumnummer

source: Asset load problem
nl: Probleem met laden van activum

# roomNameLabel
source: Room Name
nl: Kamernaam

# assetNameLabel
source: Asset Name
nl: Activanaam

# enterAssetName
source: Please enter asset name?
nl: Voer de naam van het activum in

# qtyOnHand
source: Quantity on Hand
nl: Aantal op voorraad

# enterQtyOnHand
source: Please enter quantity on hand?
nl: Voer het aantal op voorraad in

# qtyPromise
source: Quantity Promise
nl: Beloofde hoeveelheid

# enterQtyPromise
source: Please enter quantity promise?
nl: Voer de beloofde hoeveelheid in

# enterAquiredCost
source: Please enter acquired cost?
nl: Voer de verworven kosten in

source: Server problem
nl: Serverprobleem

source: Room Type Name
nl: Naam kamertype

source: Product ID Name
nl: Product-ID Naam

source: Select
nl: Selecteer

source: Room Type ID
nl: Kamertype-ID

source: Field required
nl: Veld vereist

source: Select Location
nl: Selecteer locatie

source: Location
nl: Locatie

source: No rooms found
nl: Geen kamers gevonden

source: No assets found
nl: Geen activa gevonden

source: Asset Search
nl: Activum zoeken

source: Locations
nl: Locaties

# aqrdCosts
source: Acquired Cost: {cost}
nl: Verworven kosten: {cost}

# failedToFetchAssets
source: Failed to fetch assets: {message}
nl: Activa ophalen mislukt: {message}
