Repository: growerp/growerp
Catalog: flutter/packages/growerp_order_accounting/lib/l10n/intl_*.arb
Languages: th

# nameAndCompany
source: name & Company
th: ชื่อและบริษัท

source: GlAccount #
th: บัญชีแยกประเภท #

# newGlAccount
source: New
th: ใหม่

# serverProblem
source: Server connection problem
th: ปัญหาการเชื่อมต่อเซิร์ฟเวอร์

source: GlAccount Id
th: รหัสบัญชีแยกประเภท

# glAccountIdNull
source: Please enter a glAccount Id?
th: กรุณาป้อนรหัสบัญชีแยกประเภท

source: GlAccount Name
th: ชื่อบัญชีแยกประเภท

# glAccountNameNull
source: Please enter a glAccount name?
th: กรุณาป้อนชื่อบัญชีแยกประเภท

source: Account Class
th: หมวดหมู่บัญชี

source: Select GL Account Class
th: เลือกหมวดหมู่บัญชีแยกประเภท

source: Field required
th: ต้องระบุข้อมูลในฟิลด์นี้

source: Account Type
th: ประเภทบัญชี

source: Select GL Account Type
th: เลือกประเภทบัญชีแยกประเภท

source: Posted Balance
th: ยอดคงเหลือที่ลงรายการแล้ว

source: Create
th: สร้าง

source: Update
th: อัปเดต

# fetchGlAccountFail
source: failed to fetch glAccounts:
th: ไม่สามารถดึงข้อมูลบัญชีแยกประเภทได้:

# noGlAccounts
source: No active glAccounts found
th: ไม่พบบัญชีแยกประเภทที่ใช้งานอยู่

# glAccountFile
source: GL Accounts up/download
th: อัปโหลด/ดาวน์โหลดไฟล์บัญชีแยกประเภท

source: Trial Balance
th: งบทดลอง

source: TB
th: งบทดลอง

source: Reservation
th: การจอง

# noJournalEntries
source: no journal entries found
th: ไม่พบรายการสมุดรายวัน

# noOpenTransactions
source: no (unposted) transactions found!
th: ไม่พบธุรกรรม (ที่ยังไม่ลงรายการ)!

# noOpenOrders
source: no (open) sales orders found!
th: ไม่พบใบสั่งขาย (ที่เปิดอยู่)!

# noOpenInvoices
source: no (open) sales invoices found!
th: ไม่พบใบแจ้งหนี้การขาย (ที่เปิดอยู่)!

# noOpenPayments
source: no (open) sales payments found!
th: ไม่พบการชำระเงินค่าขาย (ที่เปิดอยู่)!

# noOpenShipments
source: no (open) outgoing shipments found!
th: ไม่พบการจัดส่งขาออก (ที่เปิดอยู่)!

# noOpenRequests
source: no (open) requests found!
th: ไม่พบคำขอ (ที่เปิดอยู่)!

# noPurchaseOrders
source: no (open) purchase orders found!
th: ไม่พบใบสั่งซื้อ (ที่เปิดอยู่)!

# noPurchaseInvoices
source: no (open) purchase invoices found!
th: ไม่พบใบแจ้งหนี้การซื้อ (ที่เปิดอยู่)!

# noPurchasePayments
source: no (open) purchase payments found!
th: ไม่พบการชำระเงินค่าซื้อ (ที่เปิดอยู่)!

# noIncomingShipments
source: no (open) incoming shipments found!
th: ไม่พบการจัดส่งขาเข้า (ที่เปิดอยู่)!

source: Add New
th: เพิ่มใหม่

source: Refresh
th: รีเฟรช

# fetchItemTypesFail
source: failed to fetch itemTypes:
th: ไม่สามารถดึงข้อมูลประเภทรายการได้:

# noItemTypes
source: No Item Types Active
th: ไม่มีประเภทรายการที่ใช้งานอยู่

source: Show all/used
th: แสดงทั้งหมด/ที่ใช้

source: All
th: ทั้งหมด

source: only used
th: เฉพาะที่ใช้

# fetchPaymentTypesFail
source: failed to fetch paymentTypes:
th: ไม่สามารถดึงข้อมูลประเภทการชำระเงินได้:

source: Search
th: ค้นหา

# searchFinDoc
source: Search Financial Document
th: ค้นหา {docType}

# newRental
source: New Reservation
th: การจองใหม่

source: Sales
th: การขาย

source: Purchase
th: การซื้อ

# fetchSearchItemsFail
source: failed to fetch search items:
th: ไม่สามารถดึงข้อมูลรายการค้นหาได้:

source: Search input
th: ช่องค้นหา

# enterSearchValue
source: Please enter a search value?
th: กรุณาป้อนค่าที่ต้องการค้นหา

source: Search results
th: ผลการค้นหา

# noSearchItems
source: No search items found (yet)
th: ไม่พบรายการค้นหา (ยัง)

source: ID
th: รหัส

source: Date
th: วันที่

source: FinDoc Id
th: รหัสเอกสารทางการเงิน

source: Customer
th: ลูกค้า

source: Supplier
th: ซัพพลายเออร์

source: Select Customer
th: เลือกลูกค้า

source: Select Supplier
th: เลือกซัพพลายเออร์

source: Status
th: สถานะ

source: Description
th: คำอธิบาย

source: Created
th: สร้างเมื่อ

source: Placed
th: สั่งเมื่อ

source: Posted?
th: ลงรายการแล้ว?

source: No
th: ไม่

source: Yes
th: ใช่

source: Update Header
th: อัปเดตส่วนหัว

source: Add transaction item
th: เพิ่ม รายการธุรกรรม

source: Add other item
th: เพิ่มรายการอื่น

source: Add Rental
th: เพิ่มการเช่า

source: Add Product
th: เพิ่มสินค้า

# cancelFinDoc
source: Cancel
th: ยกเลิก

source: Clear Cart
th: ล้างตะกร้า

# noItems
source: no items yet
th: ยังไม่มีรายการ

source: Item
th: รายการ

# glAccountLabel
source: Gl Account
th: บัญชีแยกประเภท

source: Debit
th: เดบิต

source: Credit
th: เครดิต

# productId
source: ProdId
th: รหัสสินค้า

# quantity
source: Q
th: จำนวน

source: Price
th: ราคา

# subTotal
source: SubTot.
th: ยอดรวมย่อย

source: Location
th: ที่ตั้ง

# addTransactionItemTitle
source: Add Transaction Item
th: เพิ่มรายการธุรกรรม

source: Amount
th: จำนวนเงิน

source: Enter Amount?
th: กรุณาป้อนจำนวนเงิน

source: Ok
th: ตกลง

source: New order
th: ใบสั่งใหม่

# orderId
source: Order #
th: ใบสั่ง #

# reservationId
source: Reservation #
th: การจอง #

# customerSearch
source: customer,name
th: ลูกค้า,ชื่อ

source: Room Type
th: ประเภทห้อง

source: Product
th: สินค้า

source: Select product
th: เลือกสินค้า

source: Price/Amount
th: ราคา/จำนวนเงิน

# enterPriceAmount
source: Enter Price or Amount?
th: กรุณาป้อนราคาหรือจำนวนเงิน

# selectStartDate
source: Select a start date
th: เลือกวันที่เริ่มต้น

source: Start Date
th: วันที่เริ่มต้น

source: Number of days
th: จำนวนวัน

source: Cancel
th: ยกเลิก

source: Incoming Shipment #
th: การจัดส่งขาเข้า #

# itemLocationInstructions
source: For every Item either: - Select an existing location - Enter a new location - leave empty for a new location with the name of the item and received date
th: สำหรับทุกรายการ: - เลือกที่ตั้งที่มีอยู่ - ป้อนที่ตั้งใหม่ - เว้นว่างไว้สำหรับที่ตั้งใหม่ที่มี ชื่อของรายการและวันที่รับ

source: To location:
th: ไปยังที่ตั้ง:

source: location name
th: ชื่อที่ตั้ง

source: Select location
th: เลือกที่ตั้ง

source: New Location
th: ที่ตั้งใหม่

source: Go back
th: ย้อนกลับ

source: Confirm
th: ยืนยัน

source: Receive shipment
th: รับการจัดส่ง

source: Incoming
th: ขาเข้า

source: Outgoing
th: ขาออก

# paymentId
source: Payment #
th: การชำระเงิน #

# newItem
source: New
th: ใหม่

source: Select GL Account
th: เลือกบัญชีแยกประเภท

# finDocs
source: Financial Documents
th: เอกสารทางการเงิน

source: Payment Type
th: ประเภทการชำระเงิน

# enterPaymentType
source: Enter a item type for posting?
th: กรุณาป้อนประเภทรายการสำหรับการลงรายการ

source: Apply:
th: ใช้:

source: Payment Methods
th: วิธีการชำระเงิน

source: Credit Card
th: บัตรเครดิต

source: Cash
th: เงินสด

source: Check
th: เช็ค

source: Bank
th: ธนาคาร

source: Gateway Responses
th: การตอบกลับจากเกตเวย์

source: Operation
th: การดำเนินการ

source: Method
th: วิธีการ

# result
source: OK?
th: ตกลง?

source: Message:
th: ข้อความ:

source: Release
th: ปล่อย

source: Capture
th: จับ

source: Authorize
th: อนุญาต

source: Name
th: ชื่อ

source: Select
th: เลือก

source: Type
th: ประเภท

# itemOrCustomerRequired
source: A {companyRole} and at least one {docType} item is required
th: ต้องมี {companyRole} และรายการ {docType} อย่างน้อยหนึ่งรายการ

# glAccountUpDown
source: GlAccount Up/Download
th: อัปโหลด/ดาวน์โหลดบัญชีแยกประเภท

# downloadFirst
source: Download first to obtain the format
th: ดาวน์โหลดก่อนเพื่อรับรูปแบบ

# uploadCsv
source: Upload CSV file
th: อัปโหลดไฟล์ CSV

# downloadEmail
source: Download via email
th: ดาวน์โหลดผ่านอีเมล

# dataFileSendEmail
source: A data file will be send by email
th: ไฟล์ข้อมูลจะถูกส่งทางอีเมล

source: glAccount Files
th: ไฟล์บัญชีแยกประเภท

source: Total Assets
th: สินทรัพย์รวม

# totalEquityAndDistribution
source: Total Equity + Distribution
th: ส่วนของผู้ถือหุ้นและการจ่ายเงินปันผลรวม

# totalLiabilityAndEquity
source: Total Liability + Equity
th: หนี้สินและส่วนของผู้ถือหุ้นรวม

source: Total Unbooked net income
th: รายได้สุทธิที่ยังไม่ลงบัญชีรวม

# liabilityEquityUnbookedNetIncome
source: Liability + Equity + Unbd. Net Income
th: หนี้สิน + ส่วนของผู้ถือหุ้น + รายได้สุทธิที่ยังไม่ลงบัญชี

source: Previous Year
th: ปีก่อนหน้า

source: Next Year
th: ปีถัดไป

source: Year:
th: ปี:

source: Period:
th: ช่วงเวลา:

# expand
source: Exp.
th: ขยาย

# collapse
source: Col.
th: ย่อ

# glAccountIdAndName
source: Gl Account ID GL Account Name
th: รหัสบัญชีแยกประเภท ชื่อบัญชีแยกประเภท

# postedHeader
source: Posted
th: ลงรายการแล้ว

# dataForYearNotAvailable
source: Data for year {year} is not available
th: ไม่มีข้อมูลสำหรับปี {year}

# getBalanceSheetFail
source: failed to get balance sheet
th: ไม่สามารถดึงข้อมูลงบดุลได้

source: No balance summary found
th: ไม่พบสรุปยอดคงเหลือ

# getBalanceSummaryFail
source: failed to get Balance Summary
th: ไม่สามารถดึงข้อมูลสรุปยอดคงเหลือได้

source: Expand All
th: ขยายทั้งหมด

source: Collapse All
th: ย่อทั้งหมด

source: Recalculate
th: คำนวณใหม่

source: This Account
th: บัญชีนี้

source: Total Tree
th: แผนภูมิทั้งหมด

# getLedgerTreeFail
source: Could not load Ledger tree!
th: ไม่สามารถโหลดแผนภูมิบัญชีแยกประเภทได้!

source: Jan
th: ม.ค.

source: Feb
th: ก.พ.

source: Mar
th: มี.ค.

source: Apr
th: เม.ย.

source: May
th: พ.ค.

source: Jun
th: มิ.ย.

source: Jul
th: ก.ค.

source: Aug
th: ส.ค.

source: Sep
th: ก.ย.

source: Oct
th: ต.ค.

source: Nov
th: พ.ย.

source: Dec
th: ธ.ค.

source: By Month
th: รายเดือน

# noDataForPeriod
source: no data found for period
th: ไม่พบข้อมูลสำหรับช่วงเวลา

source: LedgerJournal #
th: สมุดรายวัน #

source: LedgerJournal Name
th: ชื่อสมุดรายวัน

# ledgerJournalNameNull
source: Please enter a ledgerJournal name?
th: กรุณาป้อนชื่อสมุดรายวัน

# updateHeaderShort
source: Upd.Header
th: อัปเดตส่วนหัว

# getLedgerJournalFail
source: failed to fetch ledgerJournals:
th: ไม่สามารถดึงข้อมูลสมุดรายวันได้:

# noLedgerJournalFound
source: No active ledgerJournals found
th: ไม่พบสมุดรายวันที่ใช้งานอยู่
