Repository: growerp/growerp
Catalog: flutter/packages/growerp_activity/lib/l10n/intl_*.arb
Languages: fr, nl, th

# activity_price
source: Price
fr: Prix
nl: Prijs
th: ราคา

# activity_id
source: Id
th: รหัส

# activity_status
source: Status
fr: Statut
th: สถานะ

# activity_fieldRequired
source: Field required
fr: Champ obligatoire
nl: Veld vereist
th: ต้องระบุข้อมูล

# activity_name
source: Name
fr: Nom
nl: Naam
th: ชื่อ

# activity_nameError
source: Please enter a {activityType} name?
fr: Veuillez saisir un nom de {activityType} ?
nl: Voer een {activityType} naam in?
th: กรุณาใส่ชื่อ {activityType}?

# activity_description
source: Description
nl: Omschrijving
th: คำอธิบาย

# activity_employeeName
source: employee,name
fr: employé,nom
nl: medewerker,naam
th: พนักงาน,ชื่อ

# activity_selectEmployee
source: Select employee
fr: Sélectionner un employé
nl: Selecteer medewerker
th: เลือกพนักงาน

# activity_assignee
source: Assignee Employee
fr: Employé assigné
nl: Toegewezen medewerker
th: พนักงานที่ได้รับมอบหมาย

# activity_thirdPartyName
source: third party,name
fr: tiers,nom
nl: derde partij,naam
th: บุคคลที่สาม,ชื่อ

# activity_selectThirdParty
source: Select third party
fr: Sélectionner un tiers
nl: Selecteer derde partij
th: เลือกบุคคลที่สาม

# activity_thirdParty
source: ThirdParty
fr: Tiers
nl: Derde partij
th: บุคคลที่สาม

# activity_startDate
source: Estimated start date
fr: Date de début estimée
nl: Geschatte startdatum
th: วันที่คาดว่าจะเริ่ม

# activity_update
source: Update
fr: Mettre à jour
th: อัปเดต

# activity_timeEntries
source: TimeEntries
fr: Saisies de temps
nl: Tijdregistraties
th: รายการเวลา

# activity_create
source: Create
fr: Créer
nl: CreÃ«er
th: สร้าง

# activity_new
source: New
fr: Nouveau
nl: Nieuw
th: ใหม่

# activity_loadError
source: {activityType} load problem
fr: Problème de chargement de {activityType}
nl: {activityType} laadprobleem
th: เกิดปัญหาในการโหลด {activityType}

# activity_serverError
source: server connection problem
fr: problème de connexion au serveur
nl: serververbindingsprobleem
th: ปัญหาการเชื่อมต่อเซิร์ฟเวอร์

# activity_error
source: Error: {message}
fr: Erreur : {message}
nl: Fout: {message}
th: ข้อผิดพลาด: {message}

# activity_notFound
source: No {activityType}'s found, add one with '+'
fr: Aucun(e) {activityType} trouvé(e), ajoutez-en un(e) avec '+'
nl: Geen {activityType}'s gevonden, voeg er een toe met '+'
th: ไม่พบ {activityType} เพิ่มโดยใช้ '+'

# activity_fetchError
source: failed to fetch {activityType}'s {message}
fr: échec de la récupération des {activityType}s {message}
nl: ophalen van {activityType}'s mislukt {message}
th: ดึงข้อมูล {activityType} ไม่สำเร็จ {message}

# activity_addNew
source: Add New
fr: Ajouter nouveau
nl: Nieuwe toevoegen
th: เพิ่มใหม่

# timeEntry_title
source: Enter Time Entries
fr: Saisir les saisies de temps
nl: Voer tijdregistraties in
th: ป้อนรายการเวลา

source: TimeEntryNew
fr: Nouvelle saisie de temps
nl: NieuweTijdregistratie
th: รายการเวลาใหม่

# timeEntry_id
source: TimeEntry#{timeEntryId}
fr: Saisie de temps#{timeEntryId}
nl: Tijdregistratie#{timeEntryId}
th: รายการเวลา#{timeEntryId}

# timeEntry_updateDate
source: Update date
fr: Mettre à jour la date
nl: Update datum
th: อัปเดต วันที่

# timeEntry_hours
source: # hours
fr: # heures
nl: # uren
th: จำนวนชั่วโมง

# timeEntry_hoursError
source: Please enter a number of hours?
fr: Veuillez saisir un nombre d'heures ?
nl: Voer een aantal uren in?
th: กรุณาใส่จำนวนชั่วโมง?

# timeEntry_comments
source: Comments
fr: Commentaires
nl: Opmerkingen
th: ความคิดเห็น

# timeEntry_addSuccess
source: Add successfull
fr: Ajout réussi
nl: Toevoegen gelukt
th: เพิ่มสำเร็จ

# timeEntry_updateSuccess
source: Update successfull
fr: Mise à jour réussie
nl: Update gelukt
th: อัปเดตสำเร็จ

# timeEntry_listTitle
source: Time Entry Information
fr: Informations sur la saisie de temps
nl: Informatie over tijdregistratie
th: ข้อมูลรายการเวลา

# timeEntry_notFound
source: No time entries found
fr: Aucune saisie de temps trouvée
nl: Geen tijdregistraties gevonden
th: ไม่พบรายการเวลา
