Repository: growerp/growerp
Catalog: lib/l10n/intl_*.arb
Languages: th

# productUpDown
source: Product Up/Download
th: อัปโหลด/ดาวน์โหลดสินค้า

# downloadFirst
source: Download first to obtain the format
th: ดาวน์โหลดก่อนเพื่อรับรูปแบบ

# uploadCsv
source: Upload CSV file
th: อัปโหลดไฟล์ CSV

source: Download via email
th: ดาวน์โหลดผ่านอีเมล

# dataFileSendEmail
source: A data file will be send by email
th: ไฟล์ข้อมูลจะถูกส่งทางอีเมล

# noEntityFound
source: No {entityName}s found, add one with '+'
th: ไม่พบ {entityName} เพิ่มรายการด้วย '+'

# fetchProductFailed
source: failed to fetch product: {message}
th: ไม่สามารถดึงข้อมูลสินค้าได้: {message}

# fetchSearchItemsFailed
source: failed to fetch search items: {message}
th: ไม่สามารถดึงข้อมูลรายการค้นหาได้: {message}

source: Product Search
th: ค้นหาสินค้า

source: Search input
th: ข้อมูลการค้นหา

source: Search results
th: ผลการค้นหา

# noSearchItems
source: No search items found (yet)
th: ไม่พบรายการค้นหา (ยัง)

# selectCategories
source: Select one or more categories
th: เลือกหนึ่งหมวดหมู่ขึ้นไป

source: Product Type
th: ประเภทสินค้า

source: Description
th: คำอธิบาย

source: Prices
th: ราคา

# listPrice
source: List Price({currencySymbol})
th: ราคาปลีก({currencySymbol})

# currentPrice
source: Current Price({currencySymbol})
th: ราคาปัจจุบัน({currencySymbol})

source: Currency
th: สกุลเงิน

source: Related categories
th: หมวดหมู่ที่เกี่ยวข้อง

source: Warehouse/Inventory
th: คลังสินค้า/สินค้าคงคลัง

source: Assets in warehouse
th: สินทรัพย์ในคลังสินค้า

source: Type/Amount
th: ประเภท/จำนวน

source: UOM Type
th: ประเภทหน่วยวัด

# uom
source: Unit of Measure
th: หน่วยวัด

source: Amount/Quantity
th: จำนวน/ปริมาณ

source: Create
th: สร้าง

source: Update
th: อัปเดต

source: Id
th: ไอดี

source: subscriber,name
th: ผู้สมัคร,ชื่อ

source: Select Subscriber
th: เลือกผู้สมัคร

source: Subscriber
th: ผู้สมัคร

source: From Date
th: จากวันที่

source: Thru Date
th: ถึงวันที่

source: Search products...
th: ค้นหาสินค้า...

source: Select Product
th: เลือกสินค้า

source: Product
th: สินค้า

source: Subscription Search
th: ค้นหาการสมัครสมาชิก

# fetchSubscriptionFailed
source: failed to fetch subscription: {message}
th: ไม่สามารถดึงข้อมูลการสมัครสมาชิกได้: {message}

source: Category
th: หมวดหมู่

source: Category Search
th: ค้นหาหมวดหมู่

# categoryUpDown
source: Category Up/Download
th: อัปโหลด/ดาวน์โหลดหมวดหมู่

# noCategoriesYet
source: No categories yet, add one with '+'
th: ยังไม่มีหมวดหมู่ เพิ่มด้วย '+'

# fetchCategoriesFailed
source: failed to fetch categories: {message}
th: ไม่สามารถดึงข้อมูลหมวดหมู่ได้: {message}
